//  4 Дан массив числами, например: [10, 20, 30, 50, 235, 3000]. Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.

// let arr = [10, 20, 30, 50, 235, 3000];
// for (let i = 0; i < arr.length; i++) {
//   let numb = arr[i] + "";
//   if (+numb[0] === 1 || +numb[0] === 2 || +numb[0] === 5) {
//     console.log(arr[i]);
//   }
// }

//  4 Дан массив числами, например: [10, 20, 30, 50, 235, 3000]. Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.

// let arr = [10, 20, 30, 50, 235, 3000];
// for (let i = 0; i < arr.length; i++) {
//   let numb = arr[i] + "";
//   if (+numb[0] === 1 || +numb[0] === 2 || +numb[0] === 5) {
//     console.log(arr[i]);
//   }
// }

// +arr[i].toString() [0] === 1

function helloWorld() {
  console.log("HelloWorld");
}

helloWorld();
